<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FoodTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('food')->insert([
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'សម្លកកូរ',
                'image' => 'storage/images/កកូរ.webp',
                'video_url' => 'https://example.com/video/spaghetti_bolognese',
                'cooking_time' => '១ម៉ោង៣០នាទី',
                'ingredients' => 'ត្រីឆ្លាំង ឫត្រីអណ្ដែងកន្លះគីឡូ,
                    បន្លែ(ទ្រាប់ពុតញង,ផ្កាខ្ញី, ល្ពៅ, សណ្តែកគួរ, ផ្លែម្រះ, ល្ហុង, ទ្រាប់វែង, ស្លឹកម្រុំ, ស្លឹកក្រូចសើច...)
                    ,សាច់ជ្រូក ៣ ខាំ សាច់បីជាន់
                    ,ស្លឹកម្រុម ១ដុំ
                    ,អង្ករលីង កន្លះចានចង្កឹះ
                    ,អំបិល
                    ,ប្រហុក ១ស្លាបព្រាបាយ
                    ,ទឹកត្រី ២ស្លាបព្រាបាយ
                    ,ស្ករត្នោត ១ស្លាបព្រាបាយ
                    ,ម្សៅស៊ុប ១ស្លាបព្រាបាយ
                    ,ខ្លាញ់ ២ស្លាបព្រាបាយ
                    ,គ្រឿងបុករួច (គល់ស្លឹកគ្រៃ រមៀត រំដេង សំបកក្រូចសើច ខ្ទឹមស)',

            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ម្ជូរត្រីងៀតម្រះព្រៅ',
                'image' => 'storage/images/ម្ជូរត្រីងៀតម្រះព្រៅ.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=pOeQBDOMxs4',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ត្រីងៀតប្រៃ 
,ស្លឹកម្រះព្រៅ
, អំបិលខ្ចី
, ប្រហុកចិញ្ច្រាំ 
,ម្ទេសផ្លោកតូច 
,ទឹកត្រី, អំបិល, ស្ករស, គល់ស្លឹកគ្រៃ, រំដេង, ម្ទេស, ខ្ទឹមស, ខ្តឹមក្រហម, ស្លឹកក្រូចសើច, ប៊ីចេង, “អាជីណូម៉ូតូ”, ម្សៅស៊ុប, “រ៉តឌី”, រសជាតិសាច់ជ្រូក។',
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ឆាគ្រឿងសាច់គោ',
                'image' => 'storage/images/ឆាគ្រឿងសាច់គោ.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=dS3S1ShxVJ4',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'សាច់គោ ( សាច់ស្រួយ ),
,គ្រឿងបុក, គល់ស្លឹកគ្រៃ, រំដេង, រមៀត, ស្លឹកក្រូចសើច, ខ្ទឹមស, និង សណ្ដែកដីលីង, បុកចូលគ្នា
,ម្ទេសប្លោក
,ប្រេងឆា, អំបិល, ស្ករស, ម្សៅស៊ុប, និង, ទឹកត្រី'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'សម្លរម្ជូរយួន',
                'image' => 'storage/images/សម្លរម្ជូរយួន.jpg',
                'video_url' => '//jongphov.com/%E1%9E%9A%E1%9E%94%E1%9F%80%E1%9E%94%E1%9E%9F%E1%9F%92%E1%9E%9B%E1%9E%9F%E1%9E%98%E1%9F%92%E1%9E%9B%E1%9E%98%E1%9F%92%E1%9E%87%E1%9E%BC%E1%9E%9A%E1%9E%99%E1%9E%BD%E1%9E%93%E1%9E%8F%E1%9F%92%E1%9E%9A/',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ត្រីរ៉ស់,
,ប៉េងបោះ
,ក្រអៅឈូកត្រលាច
,ម្នាស់
,ទឹកត្រី
,ម្សៅស៊ុប
,ស្ករស
,អំបិល និង អំពិលទុំ 
,ជីនាងវង
,ជីបន្លា
,ខ្ទឹមសចិញ្ច្រាំ'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ត្រីចៀនបន្លែជូរអែម',
                'image' => 'storage/images/ត្រីចៀនបន្លែជូរអែម.jpg',
                'video_url' => '//jongphov.com/%E1%9E%9A%E1%9E%94%E1%9F%80%E1%9E%94%E1%9E%9F%E1%9F%92%E1%9E%9B%E1%9E%9F%E1%9E%98%E1%9F%92%E1%9E%9B%E1%9E%98%E1%9F%92%E1%9E%87%E1%9E%BC%E1%9E%9A%E1%9E%99%E1%9E%BD%E1%9E%93%E1%9E%8F%E1%9F%92%E1%9E%9A/',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ចំនួនត្រីសមល្មម នឹង តម្រូវការរបស់អ្នក,
,ទឹកត្រី មួយស្លាព្រា
,ម្ទេសប្លោកមួយផ្លែ
,ប៉េងប៉ោះទុំមួយផ្លែ
,ដំឡូងបារាំង មួយដុំ
,ការ៉ុត មួយផ្លែ
,ម្ជូរអំពិលទុំមួយស្លាបព្រា
,អំបិល មួយស្លាបព្រាកាហ្វេ
,ស្ករស ពីរស្លាបព្រាកាហ្វេ
,ប៊ីចេង មួយស្លាបព្រាកាហ្វេ
,ប្រេងឆា មួយស្លាបព្រា',
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'សម្លការីខៀវ',
                'image' => 'storage/images/សម្លការីខៀវ.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=pYHvOmnqQ0Y ',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'សាច់មាន់ ៥ខាំ (លោកអ្នកអាចធ្វើជាមួយសាច់អ្វី ក៏បានតាមការចូលចិត្ត) ,
គ្រឿងការីខៀវ ៥០ ក្រាម, ត្រប់ពុតញង ៣ក្រាម,  ជីនាងវង ២មែក,  ម្ទេសហាវៃ ២ក្រាម,
ម្ទេសប្លោកទុំ ២ផ្លែ,  ម្ទេសហឹរ ៥គ្រាប់, ស្លឹកក្រូចសើច ៥សន្លឹក,
,ទឹកត្រី ២ស្លាបព្រាកាហ្វេ,  អំបិល ១ស្លាបព្រាកាហ្វេ,  ស្ករស៣ស្លាបព្រាកាហ្វេ, ម្រេច ១ ស្លាបព្រាកាហ្វេ, ខ្ទះដូងកន្លះកូនចាន',
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'សម្លម្ជូរបង្គា',
                'image' => 'storage/images/សម្លម្ជូរបង្គា.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=HDkfrUjigKE ',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'បង្គា ,ប៉េងប៉ោះ, ម្នាស់, ត្រឡាច, ជីររណារ, ម្អម, សណ្ដែកបណ្ដុះ,
,ខ្ទឹមស, ម្សៅស៊ុប, ស្ករស, ទឹកអំពិល, និងទឹកស៊ុបឆ្អឹងជ្រូក',
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ខគោ',
                'image' => 'storage/images/៖ខគោ.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=HDkfrUjigKE https://www.youtube.com/watch?app=desktop&v=gv90VlC4dSI',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'សាច់គោ ( សសៃ ),
,គ្រាប់ផ្កាចន្ទ័
,គ្រឿងសាតេ
,ម្ទេសក្រៀម ( ចិញ្ច្រាំអោយម៉ត់ )
,គល់ស្លឹកគ្រៃ ( កាត់ជាកង់ៗល្មម ), ស្លឹកក្រូចសើច
,រំដេង ( ហាន់ជាបន្ទះ )
,ការ៉ុត កាត់ជាកង់ៗល្មម ពុះជាបួន
,ស្ករត្នោត ,ម្សៅស៊ុប អំបិល',
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ចៀនចួនត្រី',
                'image' => 'storage/images/៖ចៀនចួនត្រី.jpg',
                'video_url' => 'https://www.youtube.com/watch?app=desktop&v=Olsx3GXqHUk',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ខ្ញី ហាន់ជាសរសៃ
,ត្រីសណ្ដាយ
,សៀងផ្អែម
,ក្រូចឆ្មារ
,ស្លឹកខ្ទឹម',
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'សម្លសម្លក់(សម្លប្រហើរ)',
                'image' => 'storage/images/៖សម្លសម្លក់(សម្លប្រហើរ).jpg',
                'video_url' => 'https://www.youtube.com/watch?app=desktop&v=6RmsYHwZG9M',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ត្រីរស់ ១ ៣-៤ក្រាម ឬអាចត្រីស្ពឹនទៅតាមដែលចូលចិត្ត
,ស្លឹកម្ទេស ១៥០ក្រាម
,ខ្ទឹមស ៤កំពឹស ដំឲ្យបែក
,ខ្ជាយ ៣ដុំ ឬអាចហាន់ជាសសៃក៍បាន
,ល្ពៅ ១ដុំតូច ចិតជាដុំៗ
,ននោង ១ផ្លែតូច ចិតជាដុំឬជារាងវែងកបាន
,ត្រឡាច ១ផ្លែតូច ចិតទទឹងរាងបន្ទះ
,ស្នៀតពោត ២០០ក្រាម
,ស្លឹកគ្រៃ ៣-៤សន្លឹកមូរដាក់ញីឲ្យបែក
,ប្រហុក ៣-៤ត្រី ទៅតាមចំណូលចិត
,ស្ករស ១ស្លាបព្រាកាហ្វេ
,ទឹកត្រី ១ស្លាបព្រាបាយកន្លះ
,ទឹកស៊ុបមាន់ ១ចាន
,ប៊ីចេង កន្លះស្លាបព្រាកាហ្វេ
,ជីក្រហម ១០សន្លឹក (ឬតាមដែលអ្នកចង់)',
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'សម្លម្ជូយួនត្រីរស់',
                'image' => 'storage/images/សម្លម្ជូយួនត្រីរស់.jpg',
                'video_url' => 'https://www.youtube.com/watch?app=desktop&v=6RmsYHwZG9M',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ត្រីរ៉សធំ 1ក្បាល
,ត្រឡាច មួយកង់
,ប៉េងប៉ោះ 2ផ្លែ
,ម្នាស់ 1ជ្រុង
,ក្រអៅឈូកខ្ចី 3ដើម
,ផ្សិចចំប៉ើង 2ខាំ
,ជីលាយជាមួយម្អម កន្លះចានចង្កឹះ
,ស្ករ ទឹកត្រី ម្សៅស៊ុប អំបិល
,ទឹកអំពិលទុំ
,រំដេងនឹងខ្ទឹមស'
            ],
            [
                'user_id' => 1,
                'category_id' => 4,
                'name' => 'សម្លខ្ទិះល្ពៅ',
                'image' => 'storage/images/៖សម្លខ្ទិះល្ពៅ.jpg',
                'video_url' => 'https://www.youtube.com/watch?app=desktop&v=q0W4Q02v2OQ',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => ',សាច់មាន់ 5០០ក្រាម ឬមួយចំហៀង(លោកអ្នកអាចធ្វើជាមួយសាច់អ្វី ក៏បានតាមការចូលចិត្ត) ,
,ល្ពៅតូចល្មម 1ផ្លែ
,ខ្ទិះដូងដើម 300មីលីត្រ ខ្ទិះចុង 500មីលីលីត្រ
,គ្រឿងបុក 2ស្លាបព្រាបាយ
,ម្ទេសប្លោកហាន់ ស្លឹកជីរនាងវង ស្លឹកក្រូចសើច
,ម្ទេសក្រៀម ចិញ្រ្ចាំអោយម៉ត់
,កាពិ
,ស្ករ អំបិល ទឹកត្រី ម្សៅស៊ុប'
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ស្ងោរជ្រកមាន់',
                'image' => 'storage/images/ស្ងោរជ្រកមាន់.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=WBsUGKGAHXk',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'មាន់ មួយចំហៀង
,ជីជ្រក់គ្រប់មុខ ក្រូចឆ្មា ម្ទេស
,រំដេង គល់ស្លឹកគ្រៃ ស្លឹកក្រូចសើច ខ្ទឹមស
,ស្ករ អំបិល ម្សៅស៊ុប ទឹកត្រី'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ស្ងោស្ពៃក្តោបស្នូលសាច់ជ្រូកចិញ្ច្រាំ',
                'image' => 'storage/images/ស្ងោស្ពៃក្តោបស្នូលសាច់ជ្រូកចិញ្ច្រាំ.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=dh3pYvEZI-s',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => ',ស្ពៃក្តោប 300 ក្រាមពុះជាពី បកចេញជាស្រទាប់ៗលាងទឹកឲ្យស្អាត
,សាច់ជ្រូក 400 ក្រាមចិញ្ច្រាំឲ្យម៉ត់
,ស្លឹកខ្ទឹម 3 ដើមកាត់យកតែស្លឹកទុកទាំងវែង
,ផ្សិត 200 ក្រាម (ផ្សិតចិន) ពុះជា 2
,ការ៉ុត 1 មើមកាត់ទទឹងជាចំណិតៗ ឬចិតជាក្បាច់រឹតតែល្អ
,ស្ករស 1 ស្លាបព្រាកាហ្វេ
,ទឹកស៊ីអ៊ីវ 1 ស្លាបព្រាកាហ្វេ
,ប្រេងខ្យង 1 ស្លាបព្រាកាហ្វេ
,ទឹកត្រី 2 ស្លាបព្រាកាហ្វេ
,ម្រេច កន្លះស្លាបព្រាបាយ
,អំបិល 1 ស្លាបព្រាកាហ្វេកន្លះ
,ម្សៅស៊ុប 1 ស្លាបព្រាកាហ្វេ
,ប៊ីចេង 1 ស្លាបព្រាកាហ្វេ
,ខ្ទឹមស 3 កំពឹសចិញ្ច្រាំ
,ជីវ៉ាន់ស៊ុយ 4 ដើម (2 ដើមហាន់តូចៗ 2 ដើមទុកដាក់ក្នុងឆ្នាំងសម្លរ)'
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ឆាក្ដៅសាច់ជ្រូកបីជាន់ជាមួយម្រះព្រៅ',
                'image' => 'storage/images/ឆាក្ដៅសាច់ជ្រូកបីជាន់ជាមួយម្រះព្រៅ.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=MTMXgH-P_q8',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => ',សាច់ជ្រូក3ជាន់ កន្លះគីឡូក្រាម
,ម្ទេសក្រៀម 5ផ្លែ
,គ្រឿងបុក 1ចានចង្កឹះ (គល់ស្លឹកគ្រៃ រំដេង ខ្ទឹមស រមៀត – ស្លឹកក្រូច)
,ខ្ទឹមសចិញ្រ្ចាំ 5កំពឹស
,ស្ករ 3ស្លាបព្រាបាយ
,អំបិល បន្តិច
,ទឹកត្រី 1ស្លាបព្រាបាយ
,ប្រេងខ្យង 1ស្លាបព្រាបាយ
,ម្សៅស៊ុប 1ស្លាបព្រាកាហ្វេ
,ស្លឹកម្រះព្រៅ ដាក់អោយច្រើនកាន់តែឆ្ងាញ់
,ប្រេងឆា'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'បង្កងឆាពងទាប្រៃ',
                'image' => 'storage/images/បង្កងឆាពងទាប្រៃ.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=8-9MLDScUbw',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => ',បង្កង (1 គីឡូ)
,ពងទាប្រៃ យកតែពណ៍ក្រហម 4 គ្រាប់
,ស្ករ, អំបិល, ទឹកត្រី, ម្សៅស៊ុប, ប្រេងខ្យង
,ខ្ទឹមសចិញ្ច្រាំលាយជាមួយម្ទេស
,ស្លឹកខ្ទឹមហាន់ល្អិត'
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ស្លសម្លរខ្ទិះឆ្អឹងជំនីជ្រូក',
                'image' => 'storage/images/ស្លសម្លរខ្ទិះឆ្អឹងជំនីជ្រូក.jpg',
                'video_url' => 'https://www.youtube.com/watch?app=desktop&v=Mx9txlDtAWQ',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ឆ្អឹងជំនីជ្រូក 500 ក្រាម (កាប់ជាដុំតូចៗ)
,ត្រប់ស្រួយ 6-7 ផ្លែ (1 កាត់ជា 2)
,ខ្ទិះដូង 1 លីត្រ (មិនបាច់មានខ្ទិះដើម ខ្ទិះចុងទេ)
,ម្ទេសឆ្អើរ 5 ផ្លែ (ចិញ្រ្ចាំឲ្យម៉ត់)
,អំពិលទុំ 1 ស្លាបព្រាបាយ
,ជីរណា 2 ដើម
,ជីនាងវង 1 ក្តាប់
,កាពិ 1 ស្លាបព្រាកាហ្វេ
,គ្រឿងបុក
,ស្លឹកក្រូចសើច 4 សន្លឹក
,ប្រេងខ្យង
,ប្រេងឆា, ប៊ីចេង, ស្ករត្នោត, ទឹកត្រី'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ស្លរសម្លរម្ជូរព្រលិត',
                'image' => 'storage/images/ស្លរសម្លរម្ជូរព្រលិត.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=BMzuKCamQwc',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ត្រីត្រីកញ្ចុះ 3០០ក្រាម
,ព្រលឹត បកសំបកចេញ រួចកាត់កង់ៗ 3០០ក្រាម
,ទឹកត្រី 1ស្លាបព្រាបាយ
,ប្រហុក 1ស្លាបព្រាបាយ
,ក្រសាំង 2ផ្លែ
,ម្ទេសខ្មាំងក្រៀម ឬ ស្រស់ 4-5 គ្រាប់
,រំដេង 1ដុំ
,អំបិលម៉ដ្ឋ 1ស្លាបព្រាកាហ្វេ
,ស្ករ កន្លះស្លាបព្រាបាយ
,ម្សៅស៊ុប 1ស្លាបព្រាកាហ្វេ
,ម្អម 2ស្លាបព្រាបាយ'
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ឆាមឹកបង្គាម្រេចខ្ចី',
                'image' => 'storage/images/ឆាមឹកបង្គាម្រេចខ្ចី.jpg',
                'video_url' => 'https://www.youtube.com/watch?app=desktop&v=lLffCRIUzwU',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'មឹកបំពង់ & បង្គា
,ម្រេចខ្ចី
,ស្លឹកក្រូចសើច
,ទឹកត្រី
,ស្ករស
,អំបិល
,ប៊ីចេង
,ប្រេងខ្យង
,ខ្ទឹមស ចិញ្ច្រាំអោយល្អិត
,ម្ទេស ហាន់បញ្ឈិតៗ'
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ស្លម្ជូសាច់គោ',
                'image' => 'storage/images/ស្លោរម្ជូសាច់គោ.jpg',
                'video_url' => ' https://www.youtube.com/watch?v=Id2e-uq-IeQ',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'សាច់គោ ៥០០ ក្រាម ហាន់ជាចំណិតស្តើងៗ 
,ភ្លៅកែបឬត្រគួន ៥០០ ក្រាម ចិតជាបញ្ឆិតវែង ២-៣ ថ្នាំងដៃ 
,ប្រហុក ១ ស្លាបព្រាបាយ (ចិញ្ច្រាំ) 
,ជីនាងវង ១ ក្តាប់ បេះជាសន្លឹកៗ 
,គ្រឿង ៣ ស្លាបព្រាបាយ (បុកហើយ) 
,ម្សៅស៊ុប កន្លះស្លាបព្រាបាយ 
,អំពិល ១ ស្លាបព្រាបាយ 
,ស្ករស កន្លះសាបព្រាបាយ'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ឆាម្នាស់សាច់ជ្រូក',
                'image' => 'storage/images/ឆាម្នាស់សាច់ជ្រូក.jpg',
                'video_url' => ' https://www.youtube.com/watch?v=Id2e-uq-IeQ',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'សាច់គោ ៥០០ ក្រាម ហាន់ជាចំណិតស្តើងៗ 
,ភ្លៅកែបឬត្រគួន ៥០០ ក្រាម ចិតជាបញ្ឆិតវែង ២-៣ ថ្នាំងដៃ 
,ប្រហុក ១ ស្លាបព្រាបាយ (ចិញ្ច្រាំ) 
,ជីនាងវង ១ ក្តាប់ បេះជាសន្លឹកៗ 
,គ្រឿង ៣ ស្លាបព្រាបាយ (បុកហើយ) 
,ម្សៅស៊ុប កន្លះស្លាបព្រាបាយ 
,អំពិល ១ ស្លាបព្រាបាយ 
,ស្ករស កន្លះសាបព្រាបាយ'
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ស្ងោរម្រះសាច់ជ្រូកចិញ្ច្រាំ',
                'image' => 'storage/images/ស្ងោរម្រះសាច់ជ្រូកចិញ្ច្រាំ.jpg',
                'video_url' => 'https://www.youtube.com/watch?app=desktop&v=X2lssfK66og',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'សាច់ជ្រូក3ជាន់ កន្លះគីឡូក្រាម
,ម្រះ 2-3ផ្លែ
,ហេប៊ី យាហ៊ឺ 2ស្លាបព្រាបាយ
,ស្ករ 1ស្លាបព្រាបាយ
,ទឹកត្រី 1ស្លាបព្រាបាយ
,ម្សៅស៊ុប កន្លះស្លាបព្រាបាយ
,ស្លឹកខ្ទឹម 4-5ដើម
,ម្រេច កន្លះស្លាបព្រាបាយ
,មីសួរ (មិនដាក់ក៏បាន)'
            ],
            [
                'user_id' => 1,
                'category_id' => 2,
                'name' => 'ស្ងោរប្រហិតត្រីជាមួយស្ពៃក្រញ៉ាញ់',
                'image' => 'storage/images/ស្ងោរប្រហិតត្រីជាមួយស្ពៃក្រញ៉ាញ់.jpg',
                'video_url' => ' https://www.youtube.com/watch?v=KQnhWz8CsFM',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ប្រហិតត្រី 500ក្រាម
,ស្ពៃកាញ៉ាញ់ 500ក្រាម
,ខ្ទឹមស ស្លឹកខ្ទឹម ម្រេច
,ស្ករ អំបិល ទឹកត្រី ម្សៅស៊ុប'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ស្ងោរជ្រក់បង្កង',
                'image' => 'storage/images/ស្ងោរជ្រក់បង្កង.jpg',
                'video_url' => 'https://www.youtube.com/watch?v=-QipYQCy4tQ',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'បង្កង 1គីឡូ
,ខ្ទឹមបារាំមតូចល្មម 1ផ្លែ
,ផ្សិតចំប៉ើង 2-3ខាំ
,ជីជ្រក់ កន្លះចានចង្កឺះ
,អំពិលខ្ចី 3-4គួរ ឬប្រើក្រូចឆ្មាក៏បាន
,ស្ករ អំបិល ម្សៅស៊ុប ទឹកត្រី
,ខ្ទឹមស ខ្ទឹមក្រហម រំដេង គល់់ស្លឹកគ្រៃ ស្លឹកក្រូចសើច'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ស្ងោរជ្រក់សាច់មាន់ត្រយ៉ូងចេក',
                'image' => 'storage/images/ស្ងោរជ្រក់សាច់មាន់ត្រយ៉ូងចេក.jpg',
                'video_url' => '  https://www.youtube.com/watch?app=desktop&v=U_Ek7HPPBww',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'មាន់ 1ក្បាល
,ត្រយ៉ូងចេក 1ផ្លែ
,គល់ស្លឹកគ្រៃ ស្លឹកក្រូចសើច រំដេង ខ្ទឹមស ម្ទេស
,ស្ករ អំបិល ទឹកត្រី ម្សៅស៊ុប
,ជីជ្រក់ ក្រូចឆ្មា'
            ],
            [
                'user_id' => 1,
                'category_id' => 3,
                'name' => 'ស្ងោរជ្រក់ត្រីឆ្ពិន',
                'image' => 'storage/images/ស្ងោរជ្រក់ត្រីឆ្ពិន.jpg',
                'video_url' => '  https://www.youtube.com/watch?app=desktop&v=U_Ek7HPPBww',
                'cooking_time' => '១ម៉ោង',
                'ingredients' => 'ត្រីឆ្ពិនស្រែធំ 1ក្បាល
,គល់ស្លឹកគ្រៃ, ស្លឹកក្រូចសើច, រំដេង, ខ្ទឹមស
,ជីជ្រក់គ្រប់មុខ, ក្រូចឆ្មា, ម្ទេស
,អំបិល, ស្ករ, ម្សៅស៊ុប, ទឹកត្រី'
            ]
        ]);
    }
}
